////Задача 1
//Задайте значение N. Напишите программу, которая выведет все натуральные числа в промежутке от 1 до N.

void ShowNumbers (int numberN = 1)
{
  Console.Write(numberN + " ");
  
  if(numberN>1) ShowNumbers(numberN - 1);
   
}
ShowNumbers(7);
